# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "bat"
brew "fzf"
brew "git"
brew "git-lfs"
brew "mas"
brew "neovim"
brew "python@3.11"
brew "ruby"
brew "sheldon"
brew "thefuck"
brew "trash-cli"
brew "tldr"  # https://tldr.sh
brew "terminal-notifier"
brew "tmux"
brew "wget"
brew "zsh"
brew "zsh-completions"

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------
tap "homebrew/cask-fonts"

# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Desktop applications
cask "arc"
cask "discord"
cask "iina"
cask "mattermost"
cask "notion"
cask "steam"
cask "telegram"

# Development
cask "fig"
cask "iterm2"
cask "netron"
cask "visual-studio-code"
cask "warp"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"

# Utils
cask "gpg-suite"
cask "logi-options-plus"
cask "openvpn-connect"
cask "raycast"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlimagesize" # https://github.com/Nyx0uf/qlImageSize
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

mas "Amphetamine", id: 937984704
mas "Dropover", id: 1355679052
mas "MyWallpaper", id: 1552826194
mas "iStat Menus", id: 1319778037

mas "GoodNotes", id: 1444383602
mas "Notability", id: 360593530
mas "Spark", id: 1176895641
mas "The Unarchiver",  id: 425424353
mas "WireGuard",  id: 1451685025
