# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# ------------------------------------------------------------------------------
# CLI Tools
# ------------------------------------------------------------------------------
brew "asitop"                    # https://github.com/tlkh/asitop
brew "bat"                       # https://github.com/sharkdp/bat
brew "docker"                    # https://docker.com
brew "fzf"                       # https://github.com/junegunn/fzf
brew "git"                       # https://git-scm.com
brew "git-lfs"                   # https://git-lfs.com
brew "mas"                       # https://github.com/mas-cli/mas
brew "neovim"                    # https://neovim.io
brew "python@3.11"               # https://python.org
brew "ruby"                      # https://ruby-lang.org/ru
brew "sheldon"                   # https://sheldon.cli.rs
brew "thefuck"                   # https://github.com/nvbn/thefuck
brew "trash-cli"                 # https://github.com/andreafrancia/trash-cli
brew "tldr"                      # https://tldr.sh
brew "terminal-notifier"         # https://github.com/julienXX/terminal-notifier
brew "tmux"                      # https://github.com/tmux/tmux/wiki
brew "wget"                      # https://gnu.org/software/wget
brew "zsh"                       # https://zsh.org
brew "zsh-completions"           # https://github.com/zsh-users/zsh-completions

# ------------------------------------------------------------------------------
# Taps
# ------------------------------------------------------------------------------


# ------------------------------------------------------------------------------
# Cask
# ------------------------------------------------------------------------------

# Desktop applications
cask "arc"                       # https://arc.net
cask "discord"                   # https://discord.com
cask "iina"                      # https://iina.io
cask "mattermost"                # https://mattermost.com
cask "notion"                    # https://notion.so
cask "spotify"                   # https://spotify.com
cask "steam"                     # https://store.steampowered.com
cask "telegram"                  # https://telegram.org
cask "whisky"                    # https://getwhisky.app

# Development
cask "jetbrains-toolbox"         # https://jetbrains.com/toolbox-app
cask "iterm2"                    # https://iterm2.com
cask "netron"                    # https://netron.app
cask "visual-studio-code"        # https://code.visualstudio.com

# Fonts
cask "font-fira-code"            # https://github.com/tonsky/FiraCode
cask "font-fira-code-nerd-font"  # https://github.com/ryanoasis/nerd-fonts/tree/master/patched-fonts/FiraCode

# Utils
cask "betterdisplay"             # https://github.com/waydabber/BetterDisplay
cask "cheatsheet"                # https://mediaatelier.com/CheatSheet
cask "gpg-suite"                 # https://gpgtools.org
cask "karabiner-elements"        # https://karabiner-elements.pqrs.org
cask "linearmouse"               # https://linearmouse.app
cask "logi-options-plus"         # https://logitech.com/en-us/software/logi-options-plus.html
cask "mos"                       # https://mos.caldis.me/
cask "openvpn-connect"           # https://openvpn.net
cask "raycast"                   # https://raycast.com
cask "vivid"                     # https://getvivid.app

# ------------------------------------------------------------------------------
# App Store applications
# ------------------------------------------------------------------------------
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

mas "Amphetamine", id: 937984704
mas "Dropover", id: 1355679052
mas "MyWallpaper", id: 1552826194
mas "iStat Menus", id: 1319778037

mas "GoodNotes", id: 1444383602
mas "Notability", id: 360593530
mas "Spark", id: 1176895641
mas "The Unarchiver",  id: 425424353
mas "WireGuard",  id: 1451685025
